01  WS-AREA. 
05  WS-NUM PIC 9(7) VALUE 99999. 
05  WS-NUM2 PIC 9(7). 
       . . .
ADD 1 TO WS-NUM. 
IF WS-NUM > 9999999 THEN 
    MOVE 0 TO WS-NUM 
    DISPLAY "Overflow occurred!" 
END-IF.